//-------------------------------------------------------------------------------------------------
// File : a3dx_restexture.h
// Desc : Texture Resource.
// Copyright(c) Project Asura. All right reserved.
//-------------------------------------------------------------------------------------------------
#pragma once

//-------------------------------------------------------------------------------------------------
// Includes
//-------------------------------------------------------------------------------------------------
#include <a3d.h>
#include <a3dx_array.h>


namespace a3d {

///////////////////////////////////////////////////////////////////////////////////////////////////
// ResSurface structure.
///////////////////////////////////////////////////////////////////////////////////////////////////
struct ResSurface
{
    uint32_t        MipIndex;
    uint32_t        RowPitch;
    uint32_t        SlicePitch;
    Array<uint8_t>  Pixels;
};

///////////////////////////////////////////////////////////////////////////////////////////////////
// ResTexture structure.
///////////////////////////////////////////////////////////////////////////////////////////////////
struct ResTexture
{
    RESOURCE_DIMENSION  Dimension;
    uint32_t            Width;
    uint32_t            Height;
    uint32_t            DepthOrArraySize;
    uint32_t            MipLevels;
    RESOURCE_FORMAT     Format;
    Array<ResSurface>   Surfaces;
};

//-------------------------------------------------------------------------------------------------
//! @brief      MAPファイルからテクスチャを読み込みします.
//!
//! @param[in]      pAllocator      アロケータです.
//! @param[in]      path            ファイルパスです.
//! @param[out]     texture         テクスチャの格納先です.
//! @retval true    読み込みに成功.
//! @retval false   読み込みに失敗.
//-------------------------------------------------------------------------------------------------
bool LoadTexture(IAllocator* pAllocator, const char* path, ResTexture& textrue);

//-------------------------------------------------------------------------------------------------
//! @brief      MAPファイルにテクスチャを保存します.
//!
//! @param[in]      path        ファイルパスです.
//! @param[in]      texture     保存するテクスチャです.
//! @retval true    保存に成功.
//! @retval false   保存に失敗.
//-------------------------------------------------------------------------------------------------
bool SaveTexture(const char* path, const ResTexture& texture);

//-------------------------------------------------------------------------------------------------
//! @brief      テクスチャを破棄します.
//!
//! @param[in,out]  texture     破棄するテクスチャです.
//-------------------------------------------------------------------------------------------------
void DisposeTexture(ResTexture& texture);

} // namespace a3d
