//-------------------------------------------------------------------------------------------------
// File : a3dxResMotion.h
// Desc : Motion Resource.
// Copyright(c) Project Asura. All right reserved.
//-------------------------------------------------------------------------------------------------
#pragma once

//-------------------------------------------------------------------------------------------------
// Includes
//-------------------------------------------------------------------------------------------------
#include <vector>
#include <a3dxMath.h>


namespace a3dx {

///////////////////////////////////////////////////////////////////////////////////////////////////
// ResMotionKey structure
///////////////////////////////////////////////////////////////////////////////////////////////////
struct ResMotionKey
{
    uint32_t    Time;           //!< フレーム番号です.
    Matrix      Transform;      //!< 変換行列です.
};

///////////////////////////////////////////////////////////////////////////////////////////////////
// ResKeyframe structure
///////////////////////////////////////////////////////////////////////////////////////////////////
struct ResKeyframe
{
    std::string                 BoneTag;    //!< ボーンタグです.
    std::vector<ResMotionKey>   Keyframe;   //!< キーフレームデータです.
};

///////////////////////////////////////////////////////////////////////////////////////////////////
// ResMotion structure
///////////////////////////////////////////////////////////////////////////////////////////////////
struct ResMotion
{
    std::string                 Tag;        //!< タグです.
    uint32_t                    Duration;   //!< 再生フレーム時間です
    std::vector<ResKeyframe>    Bone;       //!< ボーンデータです.
};

//-------------------------------------------------------------------------------------------------
//! @brief      モーションリソースを読み込みます.
//!
//! @param[in]      filename        ファイルパスです.
//! @param[out]     resource        リソースの格納先です.
//! @retval true    読み込みに成功.
//! @retval false   読み込みに失敗.
//-------------------------------------------------------------------------------------------------
bool LoadResMotion(const char* filename, ResMotion& resource);

//-------------------------------------------------------------------------------------------------
//! @brief      モーションリソースを書き込みます.
//!
//! @param[in]      filename        ファイルパスです.
//! @param[in]      resource        書き出すリソースです.
//! @retval true    書き込みに成功.
//! @retval false   書き込みに失敗.
//-------------------------------------------------------------------------------------------------
bool SaveResMotion(const char* filename, const ResMotion& resource);

} // namespace a3dx

