//-------------------------------------------------------------------------------------------------
// File : a3dx_resmesh.h
// Desc : Mesh Resource.
// Copyright(c) Project Asura. All right reserved.
//-------------------------------------------------------------------------------------------------
#pragma once

//-------------------------------------------------------------------------------------------------
// Includes
//-------------------------------------------------------------------------------------------------
#include <a3dx_math.h>
#include <a3dx_array.h>
#include <a3dx_string.h>


namespace a3d {

///////////////////////////////////////////////////////////////////////////////////////////////////
// ResMesh structure
///////////////////////////////////////////////////////////////////////////////////////////////////
struct ResMesh
{
    Array<Vector3>  Positions;
    Array<Vector3>  Normals;
    Array<Vector3>  Tangents;
    Array<Vector2>  TexCoords;
    Array<uint32_t> Indices;
    String<64>      MaterialTag;
};

//-------------------------------------------------------------------------------------------------
//! @brief      MSHファイルからメッシュを読み込みします.
//!
//! @param[in]      pAllocator      アロケータです.
//! @param[in]      path            ファイルパスです.
//! @param[out]     meshes          メッシュの格納先です.
//! @retval true    読み込みに成功.
//! @retval false   読み込みに失敗.
//-------------------------------------------------------------------------------------------------
bool LoadMesh(IAllocator* pAllocator, const char* path, Array<ResMesh>& meshes);

//-------------------------------------------------------------------------------------------------
//! @brief      MSHファイルにメッシュを書き込みします.
//!
//! @param[in]      path        ファイルパスです.
//! @param[in]      meshes      メッシュです.
//! @retval true    書き込みに成功.
//! @retval false   書き込みに失敗.
//-------------------------------------------------------------------------------------------------
bool SaveMesh(const char* path, const Array<ResMesh>& meshes);

//-------------------------------------------------------------------------------------------------
//! @brief      メッシュを破棄します.
//!
//! @param[in]      mesh        破棄するメッシュです.
//-------------------------------------------------------------------------------------------------
void DisposeMesh(ResMesh& mesh);

//-------------------------------------------------------------------------------------------------
//! @brief      メッシュを破棄します.
//!
//! @param[in]      mesh        破棄するメッシュです.
//-------------------------------------------------------------------------------------------------
void DisposeMesh(Array<ResMesh>& mesh);

} // namespace a3d
