//-------------------------------------------------------------------------------------------------
// File : a3dxResMesh.h
// Desc : Mesh Resource.
// Copyright(c) Project Asura. All right reserved.
//-------------------------------------------------------------------------------------------------
#pragma once

//-------------------------------------------------------------------------------------------------
// Includes
//-------------------------------------------------------------------------------------------------
#include <vector>
#include <a3dxMath.h>


namespace a3dx {

///////////////////////////////////////////////////////////////////////////////////////////////////
// ResBoneIndex structure
///////////////////////////////////////////////////////////////////////////////////////////////////
struct ResBoneIndex
{
    int     x;      //!< 1番目のボーン番号.
    int     y;      //!< 2番目のボーン番号.
    int     z;      //!< 3番目のボーン番号.
    int     w;      //!< 4番目のボーン番号.
};

///////////////////////////////////////////////////////////////////////////////////////////////////
// ResBone structure
///////////////////////////////////////////////////////////////////////////////////////////////////
struct ResBone
{
    std::string     Tag;            //!< タグです.
    uint32_t        ParentId;       //!< 親ボーンの番号です.
    Matrix          BindPose;       //!< バインドポーズ行列です.
    Matrix          InvBindPose;    //!< 逆バインドポーズ行列です.
};

///////////////////////////////////////////////////////////////////////////////////////////////////
// ResMesh structure
///////////////////////////////////////////////////////////////////////////////////////////////////
struct ResMesh
{
    std::string                 Tag;            //!< タグです.
    std::vector<Vector3>        Position;       //!< 位置座標です.
    std::vector<Vector2>        TexCoord;       //!< テクスチャ座標です.
    std::vector<Vector3>        Normal;         //!< 法線ベクトルです.
    std::vector<Vector3>        Tangent;        //!< 接線ベクトルです.
    std::vector<ResBoneIndex>   BoneIndex;      //!< ボーン番号です.
    std::vector<Vector4>        BoneWeight;     //!< ボーンの重みです.
    std::vector<ResBone>        Bone;           //!< ボーンです.
    std::string                 MaterialTag;    //!< マテリアルタグです.
};

//-------------------------------------------------------------------------------------------------
//! @brief      メッシュリソースを読み込みます.
//!
//! @param[in]      filename        ファイルパスです.
//! @param[out]     resource        メッシュリソースの格納先です.
//! @retval true    読み込みに成功.
//! @retval false   読み込みに失敗.
//-------------------------------------------------------------------------------------------------
bool LoadResMesh(const char* filename, std::vector<ResMesh>& resource);

//-------------------------------------------------------------------------------------------------
//! @brief      メッシュリソースを書き込みます.
//!
//! @param[in]      filename        ファイルパスです.
//! @param[in]      resource        メッシュリソースです.
//! @retval true    書き込みに成功.
//! @retval false   書き込みに失敗.
//-------------------------------------------------------------------------------------------------
bool SaveResMesh(const char* filename, const std::vector<ResMesh>& resource);

} // namespace a3dx
