//-------------------------------------------------------------------------------------------------
// File : a3dDescriptorSetLayout.h
// Desc : Descriptor Set Layout Implementation.
// Copyright(c) Project Asura. All right reserved.
//-------------------------------------------------------------------------------------------------
#pragma once


namespace a3d {

///////////////////////////////////////////////////////////////////////////////////////////////////
// DescriptorSetLayout class
///////////////////////////////////////////////////////////////////////////////////////////////////
class A3D_API DescriptorSetLayout : public IDescriptorSetLayout, public BaseAllocator
{
    //=============================================================================================
    // list of friend classes and methods.
    //=============================================================================================
    /* NOTHING */

public:
    //=============================================================================================
    // public variables.
    //=============================================================================================
    /* NOTHING */

    //=============================================================================================
    // public methods.
    //=============================================================================================

    //---------------------------------------------------------------------------------------------
    //! @brief      生成処理を行います.
    //!
    //! @param[in]      pDevice         デバイスです。
    //! @param[in]      pDesc           構成設定です.
    //! @param[out]     ppLayout        ディスクリプタセットレイアウトの格納先です.
    //! @retval true    生成に成功.
    //! @retval false   生成に失敗.
    //---------------------------------------------------------------------------------------------
    static bool A3D_APIENTRY Create(
        IDevice*                        pDevice,
        const DescriptorSetLayoutDesc*  pDesc,
        IDescriptorSetLayout**          ppLayout);

    //---------------------------------------------------------------------------------------------
    //! @brief      参照カウントを増やします.
    //---------------------------------------------------------------------------------------------
    void A3D_APIENTRY AddRef() override;

    //---------------------------------------------------------------------------------------------
    //! @brief      解放処理を行います.
    //---------------------------------------------------------------------------------------------
    void A3D_APIENTRY Release() override;

    //---------------------------------------------------------------------------------------------
    //! @brief      参照カウントを取得します.
    //!
    //! @return     参照カウントを返却します.
    //---------------------------------------------------------------------------------------------
    uint32_t A3D_APIENTRY GetCount() const override;

    //---------------------------------------------------------------------------------------------
    //! @brief      デバイスを取得します.
    //!
    //! @param[out]     ppDevice        デバイスの格納先です.
    //---------------------------------------------------------------------------------------------
    void A3D_APIENTRY GetDevice(IDevice** ppDevice) override;

    //---------------------------------------------------------------------------------------------
    //! @brief      構成設定を取得します.
    //!
    //! @return     構成設定を返却します.
    //---------------------------------------------------------------------------------------------
    DescriptorSetLayoutDesc A3D_APIENTRY GetDesc() const;

    //---------------------------------------------------------------------------------------------
    //! @brief      パイプラインレイアウトを取得します.
    //!
    //! @return     パイプラインレイアウトを返却します.
    //---------------------------------------------------------------------------------------------
    VkPipelineLayout A3D_APIENTRY GetVulkanPipelineLayout() const;

    //---------------------------------------------------------------------------------------------
    //! @brief      パイプラインバインドポイントを取得します.
    //!
    //! @return     パイプラインバインドポイントを返却します.
    //---------------------------------------------------------------------------------------------
    VkPipelineBindPoint A3D_APIENTRY GetVulkanPipelineBindPoint() const;

    //---------------------------------------------------------------------------------------------
    //! @brief      ディスクリプタプールを取得します.
    //!
    //! @return     ディスクリプタプールを返却します.
    //---------------------------------------------------------------------------------------------
    VkDescriptorPool A3D_APIENTRY GetVulkanDescriptorPool() const;

    //---------------------------------------------------------------------------------------------
    //! @brief      ディスクリプタセットレイアウトを取得します.
    //!
    //! @return     ディスクリプタセットレイアウトを返却します.
    //---------------------------------------------------------------------------------------------
    VkDescriptorSetLayout A3D_APIENTRY GetVulkanDescriptorSetLayout() const;

    //---------------------------------------------------------------------------------------------
    //! @brief      バッファ数を取得します.
    //!
    //! @return     バッファ数を返却します.
    //---------------------------------------------------------------------------------------------
    uint32_t A3D_APIENTRY GetBufferCount() const;

    //---------------------------------------------------------------------------------------------
    //! @brief      イメージ数を取得します.
    //!
    //! @return     イメージ数を返却します.
    //---------------------------------------------------------------------------------------------
    uint32_t A3D_APIENTRY GetImageCount() const;

    //---------------------------------------------------------------------------------------------
    //! @brief      サンプラー数を取得します.
    //!
    //! @return     サンプラー数を返却します.
    //---------------------------------------------------------------------------------------------
    uint32_t A3D_APIENTRY GetSamplerCount() const;

    //---------------------------------------------------------------------------------------------
    //! @brief      ディスクリプタセットを取得します.
    //! 
    //! @return     ディスクリプタセットを返却します.
    //---------------------------------------------------------------------------------------------
    VkDescriptorSet GetVkDescriptorSet() const;

private:
    //=============================================================================================
    // private variables.
    //=============================================================================================
    std::atomic<uint32_t>   m_RefCount;             //!< 参照カウントです.
    Device*                 m_pDevice;              //!< デバイスです.
    DescriptorSetLayoutDesc m_Desc;                 //!< ディスクリプタレイアウト構成設定です.
    VkDescriptorSetLayout   m_DescriptorSetLayout;  //!< ディスクリプタセットレイアウトです.
    VkPipelineLayout        m_PipelineLayout;       //!< パイプラインレイアウトです.
    VkPipelineBindPoint     m_BindPoint;            //!< パイプラインバインドポイントです.
    VkDescriptorPool        m_DescriptorPool;       //!< ディスクリプタプールです.
    uint32_t                m_ImageCount;           //!< イメージ数です.
    uint32_t                m_BufferCount;          //!< バッファ数です.
    uint32_t                m_SamplerCount;         //!< サンプラー数です.
    VkDescriptorSet         m_DescriptorSet;        //!< ディスクリプタセットです.

    //=============================================================================================
    // private methods.
    //=============================================================================================

    //---------------------------------------------------------------------------------------------
    //! @brief      コンストラクタです.
    //---------------------------------------------------------------------------------------------
    A3D_APIENTRY DescriptorSetLayout();

    //---------------------------------------------------------------------------------------------
    //! @brief      デストラクタです.
    //---------------------------------------------------------------------------------------------
    A3D_APIENTRY ~DescriptorSetLayout();

    //---------------------------------------------------------------------------------------------
    //! @brief      初期化処理を行います.
    //!
    //! @param[in]      pDevice     デバイスです.
    //! @param[in]      pDesc       構成設定です.
    //! @retval true    初期化に成功.
    //! @retval false   初期化に失敗.
    //---------------------------------------------------------------------------------------------
    bool A3D_APIENTRY Init(IDevice* pDevice, const DescriptorSetLayoutDesc* pDesc);

    //---------------------------------------------------------------------------------------------
    //! @brief      終了処理を行います.
    //---------------------------------------------------------------------------------------------
    void A3D_APIENTRY Term();

    DescriptorSetLayout (const DescriptorSetLayout&) = delete;
    void operator =     (const DescriptorSetLayout&) = delete;
};

} // namespace a3d
